/**
 * @file regexp.h
 * @brief Сопоставление имен файлов с шаблоном поиска.
 * 
 * Позволяет реализовать опцию -E, где пользователь задает маску для исключения файлов.
 */
#ifndef REGEXP_H
#define REGEXP_H

/**
 * @brief Проверяет, подходит ли имя файла под заданную маску.
 * 
 * В маске можно использовать два специальных символа:
 * - Точка (`.`) заменяет ровно один любой символ.
 * - Звездочка (`*`) заменяет любую последовательность символов.
 * 
 * @param pattern Маска для поиска.
 * @param name    Имя файла или папки, которое мы проверяем.
 * @return 1, если имя подходит под маску; 0, если не подходит.
 */
int regexp_match(const char *pattern, const char *name);

#endif